;-----------------------------------------------------------------------------
;
; (c) 1986-2025 Wolfgang G. Reißnegger <w.reissnegger@gmx.net>
; 
; Project: https://github.com/egnagflow/vmon
; License: https://github.com/egnagflow/vmon/blob/main/LICENSE
;
;-----------------------------------------------------------------------------

;-----------------------------------------------------------------------------
; Public API
;-----------------------------------------------------------------------------
.export screen_draw

;-----------------------------------------------------------------------------
; Screen update
;-----------------------------------------------------------------------------
screen_draw:
        jsr print_registers
        jsr print_opcode_lines
        jmp print_mem_dump_lines
